tobozo/ESP32-PsRamFS/src/pfs.c
bool pfs_get_psram()
{
  return pfs_psram_enabled;
}


void pfs_set_partition_size( size_t size )
{
  pfs_partition_size = size;
}


size_t pfs_get_partition_size()
{
  return pfs_partition_size;
}


void pfs_init_files()
{
  pfs_set_psram( pfs_psram_enabled );

  pfs_files = (pfs_file_t**)pfs_calloc( pfs_max_items, sizeof( pfs_file_t* ) );
  if( pfs_files == NULL ) {
    ESP_LOGE(TAG, "Unable to init pfs, halting");
    while(1);
  }
  for( int i=0; i<pfs_max_items; i++ ) {
    pfs_files[i] = (pfs_file_t*)pfs_calloc( 1, sizeof( pfs_file_t ) );
    if( pfs_files[i] == NULL ) {
      ESP_LOGE(TAG, "Unable to init pfs, halting");
      while(1);
    }
  }
  ESP_LOGD(TAG, "Init files OK");
}


void pfs_init_dirs()
{
  pfs_dirs = (pfs_dir_t **)pfs_calloc( pfs_max_items, sizeof( pfs_dir_t* ) );
  if( pfs_dirs == NULL ) {
    ESP_LOGE(TAG, "Unable to init pfs, halting");
    while(1);
  }
  for( int i=0; i<pfs_max_items; i++ ) {
    pfs_dirs[i] = (pfs_dir_t*)pfs_calloc( 1, sizeof( pfs_dir_t ) );
    if( pfs_dirs[i] == NULL ) {
      ESP_LOGE(TAG, "Unable to init pfs, halting");
      while(1);
    }
  }
  ESP_LOGD(TAG, "Init dirs OK");
}


int pfs_next_file_avail()
{
  int res = 0;
  if( pfs_files != NULL ) {
    for( int i=0; i<pfs_max_items; i++ ) {
      if( pfs_files[i]->name == NULL ) {
        ESP_LOGV(TAG, "File Slot %d out of %d is free [r]", i, pfs_max_items );
        return i;
      }
    }
    ESP_LOGE(TAG, "Too many files created.");
  } else {
    ESP_LOGE(TAG, "No allocated space for files");
  }
  return res;
}


int pfs_next_dir_avail()
{
  int res = 0;
  if( pfs_dirs != NULL ) {
    for( int i=0; i<pfs_max_items; i++ ) {
      if( pfs_dirs[i]->name == NULL ) {
        ESP_LOGV(TAG, "Dir Slot %d out of %d is free [r]", i, pfs_max_items );
        return i;
      }
    }
  }
  ESP_LOGE(TAG, "Too many dirs created, halting");
  while(1);
  return res;
}


int pfs_find_file( const char* path )
{
  if( pfs_files != NULL ) {
    for( int i=0; i<pfs_max_items; i++ ) {
      if( pfs_files[i]->name == NULL ) continue;
      if( strcmp( path, pfs_files[i]->name ) == 0 ) {
        return i;
      }
    }
  } else {
    pfs_init_files();
  }
  return -1;
}


int pfs_find_dir( const char* path )
{
  if( pfs_dirs != NULL ) {
    unsigned long entitycount = 0;
    for( int i=0; i<pfs_max_items; i++ ) {
      if( pfs_dirs[i]->name == NULL ) continue;
      if( strcmp( path, pfs_dirs[i]->name ) == 0 ) {
        return i;
      }
    }
  } else {
    pfs_init_dirs();
  }
  return -1;
}


size_t pfs_used_bytes()
{
  size_t totalsize = 0;
  if( pfs_files != NULL ) {
    for( int i=0; i<pfs_max_items; i++ ) {
      if( pfs_files[i]->name != NULL ) {
        totalsize += pfs_files[i]->size;
      }
    }
  }
  return totalsize;
}


int pfs_stat( const char * path, struct stat * stat_ )
{
  assert(path);
  memset(stat_, 0, sizeof(struct stat));

  int file_id = pfs_find_file( path );
  if( file_id > -1 ) {
    stat_->st_ino     = file_id;
    stat_->st_size    = pfs_files[file_id]->size;
    stat_->st_blksize = pfs_alloc_block_size;
    stat_->st_blocks  = (pfs_files[file_id]->size/pfs_alloc_block_size) + 1;
    stat_->st_mode    = S_IFREG;//DT_REG;
    // pfs_files[file_id]->flags |=
    // pfs_files[file_id]->flags &= ~
    // pfs_files[file_id]->flags &= ~PFS_F_WRITING;
    // pfs_files[file_id]->flags |= PFS_F_DIRTY;
    ESP_LOGV(TAG, "stating for DT_REG(%s) success (size=%d)", path, pfs_files[file_id]->size );
    return 0;
  } else {
    ESP_LOGV(TAG, "stating for DT_REG(%s) no pass", path );
  }

  int dir_id = pfs_find_dir( path );
  if( dir_id > -1 ) {
    stat_->st_size = 0;
    stat_->st_mode = S_IFDIR;//DT_DIR;
    ESP_LOGV(TAG, "stating for DT_DIR(%s) success", path );
    return 0;
  } else {
    ESP_LOGV(TAG, "stating for DT_DIR(%s) no pass", path );
  }

  //stat_->st_mode = DT_UNKNOWN;

  return 1;
}




char *pfs_flags_conv_str(int m)
{
  if( (m & O_WRONLY) && (m & O_TRUNC) ) return "w";
  if( (m & O_RDWR ) && (m & O_TRUNC) ) return "w+";
  if( m & O_RDWR ) return "r+";
  if( m & O_WRONLY ) return "a";
  if( m & O_RDWR ) return "a+";
  return "r";
}


int pfs_flags_conv(int m)
{
  int pfs_flags = 0;
  if (m == O_APPEND) {ESP_LOGV(TAG, "O_APPEND"); pfs_flags |= PFS_O_APPEND;}
  if (m == O_RDONLY) {ESP_LOGV(TAG, "O_RDONLY"); pfs_flags |= PFS_O_RDONLY;}
  if (m & O_WRONLY)  {ESP_LOGV(TAG, "O_WRONLY"); pfs_flags |= PFS_O_WRONLY;}
  if (m & O_RDWR)    {ESP_LOGV(TAG, "O_RDWR");   pfs_flags |= PFS_O_RDWR;}
  if (m & O_EXCL)    {ESP_LOGV(TAG, "O_EXCL");   pfs_flags |= PFS_O_EXCL;}
  if (m & O_CREAT)   {ESP_LOGV(TAG, "O_CREAT");  pfs_flags |= PFS_O_CREAT;}
  if (m & O_TRUNC)   {ESP_LOGV(TAG, "O_TRUNC");  pfs_flags |= PFS_O_TRUNC;}
  return pfs_flags;
}



pfs_file_t* pfs_fopen( const char * path, int flags, int fmode )
{

  if( path == NULL ) {
    ESP_LOGE(TAG, "Invalid path");
    return NULL;
  } else {
    ESP_LOGV(TAG, "Valid path :%s, flags = 0x%04x, mode = 0x%04x", path, flags, fmode );
  }

  char *mode = pfs_flags_conv_str(flags);
  int newflags = pfs_flags_conv(flags);

  int file_id = pfs_find_file( path );

  if( file_id > -1 ) {

    ESP_LOGV(TAG, "Old flags: 0x%08x, New flags: 0x%08x", pfs_files[file_id]->flags, newflags );
    pfs_files[file_id]->flags = newflags;

    // existing file
    if( mode ) {
      switch( mode[0] ) {
        case 'a': // seek end
          ESP_LOGV(TAG, "Append to index :%d", pfs_files[file_id]->size );
          if( pfs_files[file_id]->size > 0 ) {
            pfs_files[file_id]->index = pfs_files[file_id]->size;
          }
        break;
        case 'w': // truncate
          ESP_LOGV(TAG, "Truncate (mode=%s)", mode);
          if( pfs_files[file_id]->bytes != NULL ) {
            free( pfs_files[file_id]->bytes );
            pfs_files[file_id]->bytes = NULL;
          }
          pfs_files[file_id]->index = 0;
          pfs_files[file_id]->size  = 0;
        break;
        case 'r':
          ESP_LOGV(TAG, "Read (mode=%s)", mode);
          pfs_files[file_id]->index = 0;
        break;
        default:
          ESP_LOGV(TAG, "Unchanged index (mode=%s)", mode);
        break;
      }
    }
    ESP_LOGD(TAG, "file exists: %s (mode %s)", path, mode);
    //pfs_files[file_id]
    return pfs_files[file_id];
  }

  if(mode && (mode[0] != 'r' || mode[1] == '+') ) {
    // new file, write mode
    int slotscount = 0;
    int fileslot = pfs_next_file_avail();

