tobozo/ESP32-PsRamFS/src/pfs.c
  return NULL;
}


int pfs_mkdir( const char* path )
{
  int dir_id = pfs_find_dir( path );
  if( dir_id > -1 ) {
    // directory exists, no need to create
    return 0;
  }

  int slotscount = 0;
  int dirslot = pfs_next_dir_avail();
  pfs_dirs[dirslot]->name = (char*)pfs_calloc(1, sizeof( path ) +1 );
  pfs_dirs[dirslot]->dir_id = dirslot;
  memcpy( pfs_dirs[dirslot]->name, path, sizeof( path ) +1 );
  if( pfs_dirs[dirslot] != NULL ) {
    return 0;
  }
  return 1;
}


int pfs_rmdir( const char* path )
{
  int dir_id = pfs_find_dir( path );
  if( dir_id < 0 ) {
    // directory exists, no need to create
    return -1;
  }
  free( pfs_dirs[dir_id]->name );
  pfs_dirs[dir_id]->name = NULL;
  return 0;
}


struct dirent * pfs_readdir( pfs_dir_t * dir )
{
  ESP_LOGD(TAG, "[FIXME] Fake readdir (does nothing)");
  return NULL;
}


void pfs_closedir( pfs_dir_t * dir )
{
  ESP_LOGD(TAG, "[FIXME] Fake closedir (does nothing)");
  return;
}


void pfs_rewinddir( pfs_dir_t * dir )
{
  // makes no sense (yet?) to support that
  ESP_LOGD(TAG, "[FIXME] Fake rewinddir (does nothing)");
  return;
}







int vfs_pfs_fopen( const char * path, int flags, int mode )
{

  pfs_file_t* tmp = pfs_fopen( path, flags, mode );
  if( tmp != NULL ) {
    return tmp->file_id;
  }
  return -1;
}


ssize_t vfs_pfs_read( int fd, void * dst, size_t size)
{
  if( pfs_files[fd] == NULL ) return 0;
  return pfs_fread( dst, size, 1, pfs_files[fd] );
}


ssize_t vfs_pfs_write( int fd, const void * data, size_t size)
{
  if( pfs_files[fd] == NULL ) return 0;
  return pfs_fwrite( data, size, 1, pfs_files[fd] );
}


int vfs_pfs_close(int fd)
{
  if( pfs_files[fd] == NULL ) return -1;
  pfs_fclose( pfs_files[fd] );
  return 0;
}

int vfs_pfs_fsync(int fd)
{
  // not sure it's needed with ramdisk
  return fd;
}

int vfs_pfs_fstat( int fd, struct stat * st)
{
  if( pfs_files[fd] == NULL ) return -1;
  int res = pfs_stat( pfs_files[fd]->name, st );
  if( res == 1 ) return -1;
  return 0;
}

int vfs_pfs_stat( const char * path, struct stat * st)
{
  int res = pfs_stat( path, st );
  if( res == 1 ) return -1;
  return 0;
}

off_t vfs_pfs_lseek(int fd, off_t offset, int mode)
{

  if( pfs_files[fd] == NULL ) return -1;
  if ( pfs_fseek( pfs_files[fd], offset, mode ) == 0 )
     return offset;
  return -1;
}

int vfs_pfs_unlink(const char *path)
{
  int res = pfs_unlink( path ); // 0 = success, 1 = fail
  if( res == 1 ) return -1;
  return 0;
}


int vfs_pfs_rename( const char *src, const char *dst)
{
  return pfs_rename( src, dst );
}


int vfs_pfs_rmdir(const char* name)
{
  return pfs_rmdir( name );
}


int vfs_pfs_mkdir(const char* name, mode_t mode)
{
  int res = pfs_mkdir( name );
  if( res == 1 ) return -1;
  return 0;
}


DIR* vfs_pfs_opendir(const char* name)
{
  pfs_dir_t* tmp = pfs_opendir( name );
  if( tmp == NULL ) return NULL;
  return (DIR*) tmp;
}

struct dirent* vfs_pfs_readdir(DIR* pdir)
{
  if( pfs_dirs[pdir->dd_vfs_idx] == NULL ) return NULL;
  struct dirent* tmp = pfs_readdir( pfs_dirs[pdir->dd_vfs_idx] );
  return tmp;
}

int vfs_pfs_closedir(DIR* pdir)
{
  assert(pdir);
  if( pfs_dirs[pdir->dd_vfs_idx] == NULL ) return -1;
  pfs_closedir( pfs_dirs[pdir->dd_vfs_idx] );
  return 0;
}


size_t vfs_pfs_ftell(FILE* stream)
{
  return pfs_ftell( (pfs_file_t*)stream );
}



esp_err_t esp_vfs_pfs_register(const esp_vfs_pfs_conf_t* conf) {

  assert(conf->base_path);

  esp_vfs_t vfs_pfs = {
    .flags       = ESP_VFS_FLAG_DEFAULT,
    .open        = &vfs_pfs_fopen,
    .read        = &vfs_pfs_read,
    .write       = &vfs_pfs_write,
    .close       = &vfs_pfs_close,
    //.fsync       = &vfs_pfs_fsync,
    .fstat       = &vfs_pfs_fstat,
    //.ftell       = NULL,
    .stat        = &vfs_pfs_stat,
    .lseek       = &vfs_pfs_lseek,
    .unlink      = &vfs_pfs_unlink,
    .rename      = &vfs_pfs_rename,
    .mkdir       = &vfs_pfs_mkdir,
    .rmdir       = &vfs_pfs_rmdir,    // TODO: implement this
    .opendir     = &vfs_pfs_opendir,  // TODO: implement this
    .readdir     = &vfs_pfs_readdir,  // TODO: implement this
    .closedir    = &vfs_pfs_closedir, // TODO: implement this
  };

  esp_err_t err = esp_vfs_register(conf->base_path, &vfs_pfs, NULL);

  if (err != ESP_OK) {
    ESP_LOGE(TAG, "Failed to register PSramFS to \"%s\"", conf->base_path);
    return err;
  }

  ESP_LOGD(TAG, "Successfully registered PSramFS to \"%s\"", conf->base_path);

  return ESP_OK;
}



esp_err_t esp_vfs_pfs_format(const char* base_path)
{
  ESP_LOGV(TAG, "Formatting \"%s\"",  base_path );

  pfs_clean_files();

  return ESP_OK;
}



esp_err_t esp_vfs_pfs_unregister(const char* base_path)
{

  assert(base_path);

  ESP_LOGV(TAG, "Unregistering \"%s\"",  base_path );

  esp_err_t err = esp_vfs_unregister( base_path );

  if (err != ESP_OK) {
    ESP_LOGE(TAG, "Failed to unregister \"%s\"", base_path);
    return err;
  }

  pfs_free();

  return ESP_OK;
}
